iTower_20__GIS_Управление_пространственными_данными/src/BusinessProcesses/лм_БизнесПроцесс/лм_БизнесПроцесс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>лм_БизнесПроцесс</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.лм_ШаблоныБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>BusinessProcessRef.лм_БизнесПроцесс</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительОжидаетЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТочкиВхода</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Итерация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <comment>Фактическая дата завершения бизнес-процесса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Описание задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <comment>Объект системы, &quot;по поводу&quot; которого был создан бизнес-процесс.</comment>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <comment>Результат выполнения задания после завершения бизнес-процесса.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <comment>История переписки исполнителя и проверяющего</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/лм_ТочкиБизнесПроцессов/лм_ТочкиБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лм_ТочкиБизнесПроцессов</name>
  <resources>
    <name>ШаблонПодпроцесса</name>
    <type>
      <types>CatalogRef.лм_ШаблоныБизнесПроцессов</types>
    </type>
  </resources>
  <resources>
    <name>ОжидатьЗавершенияПодпроцесса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТипТочки</name>
    <type>
      <types>EnumRef.лм_ТипыТочекБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеУсловия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиАвтоподстановки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСвойства</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Групповая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОповещений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПередСтартом</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПослеСтарта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПослеЗавершения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.лм_ШаблоныБизнесПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТочки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/лм_ВыполнениеБизнесПроцессов/лм_ВыполнениеБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лм_ВыполнениеБизнесПроцессов</name>
  <resources>
    <name>Активная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.лм_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТочки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТочкиВхода</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Итерация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/лм_ТипыТочекБизнесПроцессов/лм_ТипыТочекБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>лм_ТипыТочекБизнесПроцессов</name>
  <enumValues>
    <name>ТочкаДействия</name>
  </enumValues>
  <enumValues>
    <name>ТочкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ТочкаУсловия</name>
  </enumValues>
  <enumValues>
    <name>ТочкаПодпроцесса</name>
  </enumValues>
  <enumValues>
    <name>ТочкаРазделения</name>
  </enumValues>
  <enumValues>
    <name>ТочкаСлияния</name>
  </enumValues>
  <enumValues>
    <name>ТочкаВыбора</name>
  </enumValues>
  <enumValues>
    <name>ТочкаСтарта</name>
  </enumValues>
  <enumValues>
    <name>ТочкаЗавершения</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/BusinessProcesses/лм_БизнесПроцесс/ObjectModule.bsl
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	// установить активную точку - старт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	лм_ТочкиБизнесПроцессов.ИдентификаторТочки КАК ИдентификаторТочки
	               |ИЗ
	               |	РегистрСведений.лм_ТочкиБизнесПроцессов КАК лм_ТочкиБизнесПроцессов
	               |ГДЕ
	               |	лм_ТочкиБизнесПроцессов.Шаблон = &Шаблон
	               |	И лм_ТочкиБизнесПроцессов.ТипТочки = &ТипТочки
	               |	И лм_ТочкиБизнесПроцессов.НомерВерсии = &НомерВерсии";
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	Запрос.УстановитьПараметр("ТипТочки", Перечисления.лм_ТипыТочекБизнесПроцессов.ТочкаСтарта);
	Запрос.УстановитьПараметр("НомерВерсии", НомерВерсии);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.лм_ВыполнениеБизнесПроцессов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.БизнесПроцесс = Ссылка;
			МенеджерЗаписи.ИдентификаторТочки = Выборка.ИдентификаторТочки;
			МенеджерЗаписи.ИдентификаторТочкиВхода = ИдентификаторТочкиВхода;
			МенеджерЗаписи.Итерация = 1;
			МенеджерЗаписи.Активная = Истина;
			МенеджерЗаписи.Записать();
			
			ПараметрыБП = Новый Структура;
			ПараметрыБП.Вставить("БизнесПроцесс", 			Ссылка);
			ПараметрыБП.Вставить("АктивнаяТочка", 			Выборка.ИдентификаторТочки);
			ПараметрыБП.Вставить("ИтерацияАктивной", 		1);
			ПараметрыБП.Вставить("НаименованиеВыхода", 		"");
			ПараметрыБП.Вставить("НаименованиеВарианта",	"");
			ПараметрыБП.Вставить("УсловиеВыполнено",		Ложь);
	
			лм_БизнесПроцессы.ПерейтиКСледующейТочке(ПараметрыБП);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействиеПоУмолчаниюПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ИзменениеПометкиУдаления = Ложь;
	Если Не Ссылка.Пустая() Тогда
		ТекПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
		Если ТекПометкаУдаления <> ПометкаУдаления Тогда
			ИзменениеПометкиУдаления = Истина;	
		КонецЕсли;
	КонецЕсли;
	
	Если Не ИзменениеПометкиУдаления Тогда	
		ЭтотОбъект.Завершен = ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("Завершение"), Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры
